import { IReview } from "@/entities/review/model/types"

// mock data
export const mockParticipants = [
  {
    id: 252,
    username: 'Андрей Васильев',
    image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
  },
  {
    id: 252,
    username: 'Андрей Васильев',
    image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
  },
  {
    id: 252,
    username: 'Андрей Васильев',
    image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
  },
  {
    id: 252,
    username: 'Андрей Васильев',
    image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
  },
  {
    id: 252,
    username: 'Андрей Васильев',
    image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
  },
  {
    id: 252,
    username: 'Андрей Васильев',
    image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
  },
  {
    id: 252,
    username: 'Андрей Васильев',
    image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
  },
  {
    id: 252,
    username: 'Андрей Васильев',
    image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
  },
  {
    id: 252,
    username: 'Андрей Васильев',
    image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
  },
  {
    id: 252,
    username: 'Андрей Васильев',
    image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
  },
  {
    id: 252,
    username: 'Андрей Васильев',
    image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
  },
  {
    id: 252,
    username: 'Андрей Васильев',
    image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
  },
  {
    id: 252,
    username: 'Андрей Васильев',
    image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
  },
  {
    id: 252,
    username: 'Андрей Васильев',
    image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
  },
  {
    id: 252,
    username: 'Андрей Васильев',
    image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
  },
  {
    id: 252,
    username: 'Андрей Васильев',
    image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
  },
  {
    id: 252,
    username: 'Андрей Васильев',
    image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
  },
  {
    id: 252,
    username: 'Андрей Васильев',
    image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
  },
  {
    id: 252,
    username: 'Андрей Васильев',
    image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
  },
]

// mock data
export const mockReviews: IReview[] = [
  {
    id: 1,
    rating: 4.5,
    created_by: {
      id: 1234,
      username: 'Иван Буторин',
      image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
    },
    created_at: '2024-05-30T00:00:00Z',
    review: 'Мнеоченьпонравилось!Быломноголюдей,но,темнеменее,никтонетолпился. Но музыка была слишком громкая, мешала общению с друзьями, поэтому покатались сами себе, пофоткались и ушли в более тихое место'
  },
  {
    id: 1,
    rating: 3.5,
    created_by: {
      id: 1234,
      username: 'Иван Буторин',
      image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
    },
    created_at: '2024-05-30T00:00:00Z',
    review: 'Мне очень понравилось! Было много людей, но, тем не менее, никто не толпился. Но музыка была слишком громкая, мешала общению с друзьями, поэтому покатались сами себе, пофоткались и ушли в более тихое место'
  },
  {
    id: 1,
    rating: 2,
    created_by: {
      id: 1234,
      username: 'Иван Буторин',
      image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
    },
    created_at: '2024-05-30T00:00:00Z',
    review: 'Мне очень понравилось! Было много людей, но, тем не менее, никто не толпился. Но музыка была слишком громкая, мешала общению с друзьями, поэтому покатались сами себе, пофоткались и ушли в более тихое место'
  },
  {
    id: 1,
    rating: 2.5,
    created_by: {
      id: 1234,
      username: 'Иван Буторин',
      image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
    },
    created_at: '2024-05-30T00:00:00Z',
    review: 'Мне очень понравилось! Было много людей, но, тем не менее, никто не толпился. Но музыка была слишком громкая, мешала общению с друзьями, поэтому покатались сами себе, пофоткались и ушли в более тихое место'
  },
  {
    id: 1,
    rating: 1,
    created_by: {
      id: 1234,
      username: 'Иван Буторин',
      image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
    },
    created_at: '2024-05-30T00:00:00Z',
    review: 'Мне очень понравилось! Было много людей, но, тем не менее, никто не толпился. Но музыка была слишком громкая, мешала общению с друзьями, поэтому покатались сами себе, пофоткались и ушли в более тихое место'
  },
  {
    id: 1,
    rating: 4.5,
    created_by: {
      id: 1234,
      username: 'Иван Буторин',
      image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
    },
    created_at: '2024-05-30T00:00:00Z',
    review: 'Мне очень понравилось! Было много людей, но, тем не менее, никто не толпился. Но музыка была слишком громкая, мешала общению с друзьями, поэтому покатались сами себе, пофоткались и ушли в более тихое место'
  },
  {
    id: 1,
    rating: 4.5,
    created_by: {
      id: 1234,
      username: 'Иван Буторин',
      image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
    },
    created_at: '2024-05-30T00:00:00Z',
    review: 'Мне очень понравилось! Было много людей, но, тем не менее, никто не толпился. Но музыка была слишком громкая, мешала общению с друзьями, поэтому покатались сами себе, пофоткались и ушли в более тихое место'
  },
  {
    id: 1,
    rating: 4.5,
    created_by: {
      id: 1234,
      username: 'Иван Буторин',
      image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
    },
    created_at: '2024-05-30T00:00:00Z',
    review: 'Мне очень понравилось! Было много людей, но, тем не менее, никто не толпился. Но музыка была слишком громкая, мешала общению с друзьями, поэтому покатались сами себе, пофоткались и ушли в более тихое место'
  },
  {
    id: 1,
    rating: 4.5,
    created_by: {
      id: 1234,
      username: 'Иван Буторин',
      image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
    },
    created_at: '2024-05-30T00:00:00Z',
    review: 'Мне очень понравилось! Было много людей, но, тем не менее, никто не толпился. Но музыка была слишком громкая, мешала общению с друзьями, поэтому покатались сами себе, пофоткались и ушли в более тихое место'
  },
  {
    id: 1,
    rating: 4.5,
    created_by: {
      id: 1234,
      username: 'Иван Буторин',
      image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
    },
    created_at: '2024-05-30T00:00:00Z',
    review: 'Мне очень понравилось! Было много людей, но, тем не менее, никто не толпился. Но музыка была слишком громкая, мешала общению с друзьями, поэтому покатались сами себе, пофоткались и ушли в более тихое место'
  },
  {
    id: 1,
    rating: 4.5,
    created_by: {
      id: 1234,
      username: 'Иван Буторин',
      image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
    },
    created_at: '2024-05-30T00:00:00Z',
    review: 'Мне очень понравилось! Было много людей, но, тем не менее, никто не толпился. Но музыка была слишком громкая, мешала общению с друзьями, поэтому покатались сами себе, пофоткались и ушли в более тихое место'
  },
  {
    id: 1,
    rating: 4.5,
    created_by: {
      id: 1234,
      username: 'Иван Буторин',
      image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
    },
    created_at: '2024-05-30T00:00:00Z',
    review: 'Мне очень понравилось! Было много людей, но, тем не менее, никто не толпился. Но музыка была слишком громкая, мешала общению с друзьями, поэтому покатались сами себе, пофоткались и ушли в более тихое место'
  },
  {
    id: 1,
    rating: 4.5,
    created_by: {
      id: 1234,
      username: 'Иван Буторин',
      image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
    },
    created_at: '2024-05-30T00:00:00Z',
    review: 'Мне очень понравилось! Было много людей, но, тем не менее, никто не толпился. Но музыка была слишком громкая, мешала общению с друзьями, поэтому покатались сами себе, пофоткались и ушли в более тихое место'
  },
  {
    id: 1,
    rating: 4.5,
    created_by: {
      id: 1234,
      username: 'Иван Буторин',
      image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
    },
    created_at: '2024-05-30T00:00:00Z',
    review: 'Мне очень понравилось! Было много людей, но, тем не менее, никто не толпился. Но музыка была слишком громкая, мешала общению с друзьями, поэтому покатались сами себе, пофоткались и ушли в более тихое место'
  },
  {
    id: 1,
    rating: 4.5,
    created_by: {
      id: 1234,
      username: 'Иван Буторин',
      image_url: 'images/44474d3495df4c99975f7a3ad6f5d9a0.webp'
    },
    created_at: '2024-05-30T00:00:00Z',
    review: 'Мне очень понравилось! Было много людей, но, тем не менее, никто не толпился. Но музыка была слишком громкая, мешала общению с друзьями, поэтому покатались сами себе, пофоткались и ушли в более тихое место'
  },
]
